barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountDetailsBranchFc12.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo="urn:ucbru:gbo:v5"
                  xmlns:acc="urn:ucbru:gbo:v5:acc">
    <soapenv:Header>
        <gbo:UCBRUHeaders>
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>ATSFC12AC.AccountDetailsNotify.NotificationHandler
                        </gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:15.703+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>ROUTE</gbo:RoutingRole>
                        <gbo:Comment>Routing in SACC.v5.AcDeNo</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.v5.AcDeNo.NotificationHandler</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.157+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment>Start of message processing</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.AccountListQuery.RequestHandler</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.186+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment>Start of message processing</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler
                        </gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.210+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment>Start of message processing</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler
                        </gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.236+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>ROUTE</gbo:RoutingRole>
                        <gbo:Comment>All accounts received from the cache</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.MasterAccountPositioningBatchQuery.ResponseHandler
                        </gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.251+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment>Finish of message processing</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.AccountListQuery.ABSRouter</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.275+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>ROUTE</gbo:RoutingRole>
                        <gbo:Comment>Routing by cache settings</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.AccountListQuery.ResponseHandler</gbo:Application.Module>
                        <gbo:VersionId>5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.524+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>ROUTE SUCCESS</gbo:RoutingRole>
                        <gbo:Comment>The responses received from ECHO,FC12</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.AccountListQuery.ResponseHandler</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.527+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment>Finish of message processing</gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SACC.v5.AcDeNo.PublishHandler</gbo:Application.Module>
                        <gbo:VersionId>v5</gbo:VersionId>
                        <gbo:TimeStamp>2017-12-13T16:23:16.553+03:00</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment>Finish of message processing</gbo:Comment>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </soapenv:Header>
    <soapenv:Body>
        <acc:AccountList>
            <acc:AccountDetails>
                <acc:AccountNo>00753387RURCOSA101</acc:AccountNo>
                <acc:Branch>B05</acc:Branch>
                <acc:CBAccountNo>40702810400024872260</acc:CBAccountNo>
                <acc:Ccy>RUR</acc:Ccy>
                <acc:Description>Agrokompleks LMK OOO</acc:Description>
                <acc:Status>O</acc:Status>
                <acc:CustomerNo>00753387</acc:CustomerNo>
                <acc:Special>COSA1</acc:Special>
                <acc:OpenDate>2016-04-21</acc:OpenDate>
                <acc:AltAccountNo>753387RUR401102031</acc:AltAccountNo>
                <acc:ATMAvailable>N</acc:ATMAvailable>
                <acc:CreditTransAllowed>Y</acc:CreditTransAllowed>
                <acc:DebitTransAllowed>N</acc:DebitTransAllowed>
                <acc:BackPeriodEntryAllowed>Y</acc:BackPeriodEntryAllowed>
                <acc:AutoProvisionRequired>N</acc:AutoProvisionRequired>
                <acc:ClearingAccountNo>00753387RURCOSA101</acc:ClearingAccountNo>
                <acc:DormantParameter>B</acc:DormantParameter>
                <acc:ExcludeReversalTrans>N</acc:ExcludeReversalTrans>
                <acc:MT210Required>N</acc:MT210Required>
                <acc:SweepType>1</acc:SweepType>
                <acc:CorBank>044030858</acc:CorBank>
                <acc:CorINN>7710030411</acc:CorINN>
                <acc:Positioning>
                    <acc:CBAccount>40702810400024872260</acc:CBAccount>
                    <acc:IMBAccountNo>00753387RURCOSA101</acc:IMBAccountNo>
                    <acc:IMBBranch>B05</acc:IMBBranch>
                    <acc:HostABSAccountNo>00753387RURCOSA101</acc:HostABSAccountNo>
                    <acc:HostABSBranch>B05</acc:HostABSBranch>
                    <acc:HostABS>FC12</acc:HostABS>
                </acc:Positioning>
                <acc:GLCredit>
                    <acc:CBLine>LI400</acc:CBLine>
                    <acc:GLValue>202019102</acc:GLValue>
                    <acc:HOLine>202000</acc:HOLine>
                </acc:GLCredit>
                <acc:GLDebit>
                    <acc:CBLine>AS400</acc:CBLine>
                    <acc:GLValue>105049022</acc:GLValue>
                    <acc:HOLine>105000</acc:HOLine>
                </acc:GLDebit>
                <acc:StmtSettings>
                    <acc:Cycle>D</acc:Cycle>
                    <acc:Type>D</acc:Type>
                    <acc:GenOnMovement>Y</acc:GenOnMovement>
                </acc:StmtSettings>
                <acc:Stmt2Settings>
                    <acc:Type>N</acc:Type>
                </acc:Stmt2Settings>
                <acc:Stmt3Settings>
                    <acc:Type>N</acc:Type>
                </acc:Stmt3Settings>
                <acc:PrevStmt/>
                <acc:PrevStmt2/>
                <acc:PrevStmt3/>
                <acc:MIS>
                    <acc:Pool>POOL2</acc:Pool>
                </acc:MIS>
                <acc:AccountingType>441010100</acc:AccountingType>
                <acc:ControlledAccount>Y</acc:ControlledAccount>
                <acc:OpenBalance>1000</acc:OpenBalance>
                <acc:CurrentBalance>171000</acc:CurrentBalance>
                <acc:AvailableBalance>153119.43</acc:AvailableBalance>
                <acc:UncollectedBalance>0</acc:UncollectedBalance>
                <acc:CreditTurnoverToday>170000</acc:CreditTurnoverToday>
                <acc:DebitTurnoverToday>0</acc:DebitTurnoverToday>
                <acc:BlockedAmount>1000</acc:BlockedAmount>
                <acc:DebitAccrued>0</acc:DebitAccrued>
                <acc:CreditAccrued>0</acc:CreditAccrued>
                <acc:UnutilizedOverdraftLimit>0</acc:UnutilizedOverdraftLimit>
                <acc:GWSAccType>CURR</acc:GWSAccType>
                <acc:OperationTypeCodes>VIEW=1,DOMPAY=1,DOMTAX=1,DOMCUS=1,CUPACO=1,CUSEOC=1,CURBUY=1,CUOPCE=1,
                </acc:OperationTypeCodes>
            </acc:AccountDetails>
        </acc:AccountList>
    </soapenv:Body>
</soapenv:Envelope>